app/controllers/master/city_controller.rb

  def create
    @city = Master::City.new(city_params)
    if @city.save
---
INSERT INTO "master_cities" ("name", "status_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Surat"], ["status_id", 3], ["created_at", "2018-07-17 05:44:35.242860"], ["updated_at", "2018-07-17 05:44:35.242860"]]

  def update
    @city = Master::City.find(params[:id])
    if @city.update_attributes(city_params)
---
UPDATE "master_cities" SET "name" = $1, "status_id" = $2, "updated_at" = $3 WHERE "master_cities"."id" = $4  [["name", ""], ["status_id", nil], ["updated_at", "2018-07-17 05:49:57.006723"], ["id", 4]]

  def destroy
    @city = Master::City.find(params[:id])
    if @city.destroy
---
DELETE FROM "master_cities" WHERE "master_cities"."id" = $1  [["id", 2]]