app/controllers/master/speciality_controller.rb

INSERT INTO "master_specialities" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Gynecilogist"], ["description", "mhbjmehbcjksnedjkjndsc\r\n"], ["created_at", "2018-07-17 06:11:01.951384"], ["updated_at", "2018-07-17 06:11:01.951384"]]
---
  def create
    @speciality = Master::Speciality.new(page_params)
    if @speciality.save

UPDATE "master_specialities" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "master_specialities"."id" = $4  [["name", "Gynecilogist"], ["description", "ww"], ["updated_at", "2018-07-18 08:05:22.421977"], ["id", 1]]
---
  def update
    @speciality = Master::Speciality.find(params[:id])
    if @speciality.update_attributes(page_params)

DELETE FROM "master_specialities" WHERE "master_specialities"."id" = $1  [["id", 2]]
---
  def destroy
    @speciality = Master::Speciality.find(params[:id])
    if @speciality.destroy