app/controllers/nutritionist/profile_controller.rb

INSERT INTO "nutritionist_profiles" ("name", "email", "dob", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Rohan"], ["email", "Rj@gmail.com"], ["dob", "1997-09-12 00:00:00"], ["created_at", "2018-07-17 07:00:10.399863"], ["updated_at", "2018-07-17 07:00:10.399863"]]
---
  def create
    @nutritionist = Nutritionist::Profile.new(page_params)
    if @nutritionist.save

UPDATE "nutritionist_profiles" SET "about" = $1, "updated_at" = $2 WHERE "nutritionist_profiles"."id" = $3  [["about", ""], ["updated_at", "2018-07-18 11:53:44.490023"], ["id", 11]]
---
  def update
    @nutritionist = Nutritionist::Profile.find(params[:id])
    if @nutritionist.update_attributes(page_params)

DELETE FROM "nutritionist_profiles" WHERE "nutritionist_profiles"."id" = $1  [["id", 6]]
---
  def destroy
    @nutritionist = Nutritionist::Profile.find(params[:id])
    if @nutritionist.destroy